#+TITLE: voom estimation
#+SETUPFILE: setup.org

* Setup                                                            :noexport:

  #+BEGIN_SRC emacs-lisp
    (org-babel-lob-ingest "/home/aksarkar/projects/singlecell-qtl/analysis/sc-vs-bulk.org")
    (org-babel-lob-ingest "/home/aksarkar/.emacs.d/org-templates/library.org")
  #+END_SRC

  #+RESULTS:
  : 1

  #+CALL: ipython3(memory="16G", venv="scqtl") :dir /scratch/midway2/aksarkar/singlecell

  #+RESULTS:
  : Submitted batch job 40916778

  #+BEGIN_SRC ipython
    import functools
    import os.path
    import numpy as np
    import pandas as pd
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  #+CALL: concordance-def()

  #+RESULTS:
  :RESULTS:
  :END:

  #+CALL: load-data-defs()

  #+RESULTS:
  :RESULTS:
  :END:

  #+CALL: load-data()

* Mean phenotype definition

  Estimate the mean count per individual, per gene using non-zero counts only,
  then transform to \(log_2(\mathrm{CPM} + 1)\). 

  We still have to deal with the case where a gene is not detected in any cells
  in a particular individual. As a first pass, simply treat their mean
  expression as a true zero.

  #+BEGIN_SRC ipython
    vcf = (pd.read_table('/project2/gilad/singlecell-qtl/bulk/genotypes.vcf.gz', nrows=1)
           .rename(columns=lambda x: 'NA{}'.format(x) if x.startswith('1') else x))
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython
    mean = cpm(umi_qc.mask(umi_qc == 0)
               .groupby(annotations_qc['chip_id'].values, axis=1)
               .agg(np.mean)
               .filter(items=vcf.columns)
               .rename(columns=lambda x: x[2:])  # match original VCF
               .fillna(0),
               log2=True)
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

